glcloud/keil_v5/ARM/PACK/.Web/Keil.Kinetis_KMxx_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>http://www.keil.com/pack/</url>
  <name>Kinetis_KMxx_DFP</name>
  <description>NXP Kinetis KMxx Series Device Support and Examples</description>

  <releases>
    <release version="1.3.0" date="2016-07-12">
      Reworked KMxx_DFP.
       - changed vendor to NXP.
       - updated documentation.
       - updated boards description.
       - changed device vendor to NXP in projects.
    </release>
    <release version="1.2.0" date="2015-06-03">
      Added Device Support for: MKM34Z2567.
      Added TWR-KM34Z50MV3 board support.
      Updated RTX Blinky examples.
      Reworked conditions.
    </release>
    <release version="1.1.0" date="2014-11-03">
      Added Device Support for: KM14Z64A  KM14Z128A  KM33Z64A  KM33Z128A  KM34Z128A.
      SRAM range correction.
    </release>
    <release version="1.0.1">
      Added Device Support for: MKM13Z64xxx5, MKM32Z64xxx5, MKM38Z128xxx5.
    </release>
    <release version="1.0.0">
      First Release version of KMxx Device Family Pack.
    </release>
  </releases>

  <keywords>
  <!-- keywords for indexing -->
    <keyword>NXP</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package NXP</keyword>
    <keyword>KMxx</keyword>
  </keywords>

  <devices>
    <family Dfamily="KMxx Series" Dvendor="NXP:11">
      <processor Dcore="Cortex-M0+" DcoreVersion="r0p0"/>
      <book name="Documents/dui0662a_cortex_m0p_r0p0_dgug.pdf" title="Cortex-M0+ Generic User Guide"/>
      <description>
Kinetis M series MCUs are based upon the low-power ARM® Cortex®-M0+ core and are designed for single-chip 1, 2 and 3 -phase electricity meters as well as flow meter and other precision measurement applications.
      </description>

      <!-- ******************************  KM1x  ****************************** -->
      <subFamily DsubFamily="KM1x">
        <description>
Kinetis KM1x MCUs enable single-chip one-, two-, and three-phase electricity meters, as well as flow meter and other precision measurement applications.
 - Includes a powerful analog front end
 - Provides security, including memory protection, tamper detection, and protection of supplier/user data
 - Supports high-precision internal voltage reference with low temperature drift
 - Features a comprehensive enablement suite including reference designs
        </description>

        <!-- ******************************  MKM13Z64xxx5  ****************************** -->
        <device Dname="MKM13Z64xxx5">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device/Include/MKM13Z5.h" define="MKM13Z64xxx5"/>
          <debug svd="SVD/MKM13Z5.svd"/>
          <memory id="IROM1"                     start="0x00000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                     start="0x1FFFF000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash/MKMP64_1KB.FLM" start="0x00000000" size="0x00010000" RAMstart="0x20000000" RAMsize="0x1000" default="1"/>
        </device>

        <!-- ******************************  MKM14Z128xxx5  ****************************** -->
        <device Dname="MKM14Z128xxx5">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device/Include/MKM14Z5.h" define="MKM14Z128xxx5"/>
          <debug svd="SVD/MKM14Z5.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x1FFFF000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash/MKMP128_1KB.FLM" start="0x00000000" size="0x00020000" RAMstart="0x20000000" RAMsize="0x1000" default="1"/>

          <book name="Documents/MKMxxZxxCxx5RM.pdf" title="MKM14Z128xxx5 Device Reference Manual"/>
          <book name="Documents/MKMxxZxxCxx5.pdf"   title="MKM14Z128xxx5 Device Data Sheet"/>
        </device>

        <!-- ******************************  MKM14Z64xxx5  ****************************** -->
        <device Dname="MKM14Z64xxx5">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device/Include/MKM14Z5.h" define="MKM14Z64xxx5"/>
          <debug svd="SVD/MKM14Z5.svd"/>
          <memory id="IROM1"                     start="0x00000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                     start="0x1FFFF000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash/MKMP64_1KB.FLM" start="0x00000000" size="0x00010000" RAMstart="0x20000000" RAMsize="0x1000" default="1"/>

          <book name="Documents/MKMxxZxxCxx5RM.pdf" title="MKM14Z64xxx5 Device Reference Manual"/>
          <book name="Documents/MKMxxZxxCxx5.pdf"   title="MKM14Z64xxx5 Device Data Sheet"/>
        </device>

        <!-- ******************************  MKM14Z64Axxx5  ****************************** -->
        <device Dname="MKM14Z64Axxx5">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device/Include/MKM14ZA5.h" define="MKM14Z64Axxx5"/>
          <debug svd="SVD/MKM14ZA5.svd"/>
          <memory id="IROM1"                     start="0x00000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                     start="0x1FFFF000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash/MKMP64_1KB.FLM" start="0x00000000" size="0x00010000" RAMstart="0x20000000" RAMsize="0x1000" default="1"/>

          <book name="Documents/MKMxxZxxACxx5RM.pdf" title="MKM34Z128Axxx5 Device Reference Manual"/>
          <book name="Documents/MKMxxZxxACxx5.pdf"   title="MKM34Z128Axxx5 Device Data Sheet"/>
        </device>

        <!-- ******************************  MKM14Z128Axxx5  ****************************** -->
        <device Dname="MKM14Z128Axxx5">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device/Include/MKM14ZA5.h" define="MKM14Z128Axxx5"/>
          <debug svd="SVD/MKM14ZA5.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x1FFFF000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash/MKMP128_1KB.FLM" start="0x00000000" size="0x00020000" RAMstart="0x20000000" RAMsize="0x1000" default="1"/>

          <book name="Documents/MKMxxZxxACxx5RM.pdf" title="MKM34Z128Axxx5 Device Reference Manual"/>
          <book name="Documents/MKMxxZxxACxx5.pdf"   title="MKM34Z128Axxx5 Device Data Sheet"/>
        </device>
      </subFamily>

      <!-- ******************************  KM3x  ****************************** -->
      <subFamily DsubFamily="KM3x">
        <description>
Kinetis KM3x MCUs enable single-chip one-, two-, and three-phase electricity meters, as well as flow meters and other precision measurement applications.
 - Provides security with active and passive tamper detection with time stamping
 - Supports high-precision internal voltage reference with low temperature drift
 - Features a comprehensive enablement suite including reference designs
        </description>

        <!-- ******************************  MKM32Z64xxx5  ****************************** -->
        <device Dname="MKM32Z64xxx5">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device/Include/MKM32Z5.h" define="MKM32Z64xxx5"/>
          <debug svd="SVD/MKM32Z5.svd"/>
          <memory id="IROM1"                     start="0x00000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                     start="0x1FFFF000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash/MKMP64_1KB.FLM" start="0x00000000" size="0x00010000" RAMstart="0x20000000" RAMsize="0x1000" default="1"/>
        </device>

