glcloud/keil_v5/ARM/PACK/.Web/Keil.Kinetis_KMxx_DFP.pdsc
        <!-- ******************************  MKM33Z128xxx5  ****************************** -->
        <device Dname="MKM33Z128xxx5">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device/Include/MKM33Z5.h" define="MKM33Z128xxx5"/>
          <debug svd="SVD/MKM33Z5.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x1FFFF000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash/MKMP128_1KB.FLM" start="0x00000000" size="0x00020000" RAMstart="0x20000000" RAMsize="0x1000" default="1"/>

          <book name="Documents/MKMxxZxxCxx5RM.pdf" title="MKM33Z128xxx5 Device Reference Manual"/>
          <book name="Documents/MKMxxZxxCxx5.pdf"   title="MKM33Z128xxx5 Device Data Sheet"/>
        </device>

        <!-- ******************************  MKM33Z64xxx5  ****************************** -->
        <device Dname="MKM33Z64xxx5">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device/Include/MKM33Z5.h" define="MKM33Z64xxx5"/>
          <debug svd="SVD/MKM33Z5.svd"/>
          <memory id="IROM1"                     start="0x00000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                     start="0x1FFFF000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash/MKMP64_1KB.FLM" start="0x00000000" size="0x00010000" RAMstart="0x20000000" RAMsize="0x1000" default="1"/>

          <book name="Documents/MKMxxZxxCxx5RM.pdf" title="MKM33Z64xxx5 Device Reference Manual"/>
          <book name="Documents/MKMxxZxxCxx5.pdf"   title="MKM33Z64xxx5 Device Data Sheet"/>
        </device>

        <!-- ******************************  MKM34Z128xxx5  ****************************** -->
        <device Dname="MKM34Z128xxx5">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device/Include/MKM34Z5.h" define="MKM34Z128xxx5"/>
          <debug svd="SVD/MKM34Z5.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x1FFFF000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash/MKMP128_1KB.FLM" start="0x00000000" size="0x00020000" RAMstart="0x20000000" RAMsize="0x1000" default="1"/>

          <book name="Documents/MKMxxZxxCxx5RM.pdf" title="MKM34Z128xxx5 Device Reference Manual"/>
          <book name="Documents/MKMxxZxxCxx5.pdf"   title="MKM34Z128xxx5 Device Data Sheet"/>
        </device>

        <!-- ******************************  MKM38Z128xxx5  ****************************** -->
        <device Dname="MKM38Z128xxx5">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device/Include/MKM38Z5.h" define="MKM38Z128xxx5"/>
          <debug svd="SVD/MKM38Z5.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x1FFFF000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash/MKMP128_1KB.FLM" start="0x00000000" size="0x00020000" RAMstart="0x20000000" RAMsize="0x1000" default="1"/>
        </device>

        <!-- ******************************  MKM33Z64Axxx5  ****************************** -->
        <device Dname="MKM33Z64Axxx5">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device/Include/MKM33ZA5.h" define="MKM33Z64Axxx5"/>
          <debug svd="SVD/MKM33ZA5.svd"/>
          <memory id="IROM1"                     start="0x00000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                     start="0x1FFFF000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash/MKMP64_1KB.FLM" start="0x00000000" size="0x00010000" RAMstart="0x20000000" RAMsize="0x1000" default="1"/>

          <book name="Documents/MKMxxZxxACxx5RM.pdf" title="MKM34Z128Axxx5 Device Reference Manual"/>
          <book name="Documents/MKMxxZxxACxx5.pdf"   title="MKM34Z128Axxx5 Device Data Sheet"/>
        </device>

        <!-- ******************************  MKM33Z128Axxx5  ****************************** -->
        <device Dname="MKM33Z128Axxx5">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device/Include/MKM33ZA5.h" define="MKM33Z128Axxx5"/>
          <debug svd="SVD/MKM33ZA5.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x1FFFF000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash/MKMP128_1KB.FLM" start="0x00000000" size="0x00020000" RAMstart="0x20000000" RAMsize="0x1000" default="1"/>

          <book name="Documents/MKMxxZxxACxx5RM.pdf" title="MKM34Z128Axxx5 Device Reference Manual"/>
          <book name="Documents/MKMxxZxxACxx5.pdf"   title="MKM34Z128Axxx5 Device Data Sheet"/>
        </device>

        <!-- ******************************  MKM34Z128Axxx5  ****************************** -->
        <device Dname="MKM34Z128Axxx5">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device/Include/MKM34ZA5.h" define="MKM34Z128Axxx5"/>
          <debug svd="SVD/MKM34ZA5.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x1FFFF000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash/MKMP128_1KB.FLM" start="0x00000000" size="0x00020000" RAMstart="0x20000000" RAMsize="0x1000" default="1"/>

          <book name="Documents/MKMxxZxxACxx5RM.pdf" title="MKM34Z128Axxx5 Device Reference Manual"/>
          <book name="Documents/MKMxxZxxACxx5.pdf"   title="MKM34Z128Axxx5 Device Data Sheet"/>
        </device>
      </subFamily>

      <!-- ******************************  KM3x_256 ************************* -->
      <subFamily DsubFamily="KM3x_256">
        <description>
The Kinetis KM3x_256 MCUs are based on 32-bit ARM Cortex  M0+ core with integrated Analog Front End (AFE). CPU clock rates on these devices can reach up to 75 MHz.
The KM3x_256 family of devices includes memory-mapped arithmetic unit (MMAU), highly accurate Sigma Delta (SD) ADC, Programmable Gain Amplifier (PGA), high precision internal voltage reference, flash, RAM, phase compensation logic block and other peripherals.
KM3x_256 family also provides tamper detection and accurate real time clock on all devices.
        </description>

        <!-- ******************************  MKM34Z256xxx7  ****************************** -->
        <device Dname="MKM34Z256xxx7">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="75000000"/>
          <compile header="Device/Include/MKM34Z7.h" define="MKM34Z256xxx7"/>
          <debug svd="SVD/MKM34Z7.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x1FFFE000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash/MKMP256_2KB.FLM" start="0x00000000" size="0x00040000" RAMstart="0x20000000" RAMsize="0x1000" default="1"/>

