glcloud/keil_v5/ARM/PACK/.Web/Keil.Kinetis_KMxx_DFP.pdsc
  <boards>
    <board name="TWR-KM34Z50" vendor="NXP" revision="Rev. A" salesContact="http://www.nxp.com/support/sales-and-support:SUPPORTHOME">
      <mountedDevice    deviceIndex="0" Dvendor="NXP:11" Dname="MKM34Z128xxx5"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" Dfamily="KMxx Series" DsubFamily="KM3x"/>
      <description>TWR-KM34Z50M: Kinetis M Series Tower System Module.</description>
      <book category="overview"  name="http://www.nxp.com/products/microcontrollers-and-processors/arm-processors/kinetis-cortex-m-mcus/m-series-metrology-m0-plus/kinetis-m-series-tower-system-module:TWR-KM34Z50M"  title="TWR-KM34Z50M: Kinetis M Series Tower System Module"/>
      <book category="manual"    name="Boards/NXP/TWR-KM34Z50/Documents/TWRKM34Z50UM.pdf" title="TWR-KM34Z50 Tower Module User Manual"/>
      <feature type="ODbg"           n="1"              name="Integrated open-source JTAG via USB"/>
      <feature type="PWR"            n="5"              name="USB Powered"/>
      <feature type="Button"         n="4"              name="Reset, Tamper, two user button"/>
      <feature type="LED"            n="4"              name="user-controllable LEDs"/>
      <feature type="Accelerometer"  n="1"              name="MMA8491Q Three-axis accelerometer"/>
      <feature type="Poti"           n="1"              name="Potentiometer"/>
      <feature type="ContOther"      n="1"              name="NTC temperature sensor"/>
      <feature type="IrDA"           n="1"              name="IrDA support"/>
    </board>
    
    <board name="TWR-KM34Z50MV3" vendor="NXP" revision="Rev. A2" salesContact="http://www.nxp.com/support/sales-and-support:SUPPORTHOME">
      <mountedDevice    deviceIndex="0" Dvendor="NXP:11" Dname="MKM34Z128Axxx5"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" Dfamily="KMxx Series" DsubFamily="KM3x"/>
      <description>TWR-KM34Z50MV3: Kinetis M Series Tower System Module.</description>
      <image small="Boards/NXP/TWR-KM34Z50MV3/Documents/TWR-KM34Z50MV3_small.jpg"/>
      <book category="overview"  name="http://www.nxp.com/products/microcontrollers-and-processors/arm-processors/kinetis-cortex-m-mcus/m-series-metrology-m0-plus/kinetis-m-series-tower-system-module:TWR-KM34Z50M"  title="TWR-KM34Z50M: Kinetis M Series Tower System Module"/>
      <book category="manual"    name="Boards/NXP/TWR-KM34Z50MV3/Documents/TWRKM34Z50UM.pdf" title="TWR-KM34Z50MV3 Tower Module User Manual"/>
      <feature type="ODbg"           n="1"              name="Integrated open-source JTAG via USB"/>
      <feature type="PWR"            n="5"              name="USB Powered"/>
      <feature type="Button"         n="4"              name="Reset, Tamper, two user button"/>
      <feature type="LED"            n="4"              name="user-controllable LEDs"/>
      <feature type="Accelerometer"  n="1"              name="MMA8491Q Three-axis accelerometer"/>
      <feature type="Poti"           n="1"              name="Potentiometer"/>
      <feature type="ContOther"      n="1"              name="NTC temperature sensor"/>
      <feature type="IrDA"           n="1"              name="IrDA support"/>
      <debugInterface adapter="JTAG/SW" connector="10 pin Cortex debug (0.05 inch connector)"/>
    </board>
  </boards>

  <examples>
    <!-- TWR-KM34Z50 Tower Board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/NXP/TWR-KM34Z50/RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="TWR-KM34Z50" vendor="NXP" Dvendor="NXP:11" Dname="MKM34Z128xxx5"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <!-- TWR-KM34Z50MV3 Tower Board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/NXP/TWR-KM34Z50MV3/Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="TWR-KM34Z50MV3" vendor="NXP" Dvendor="NXP:11" Dname="MKM34Z128Axxx5"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
  </examples>

</package>
